---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRoundHSS
source: html/c8eeb749-40b1-9f32-e1f9-3034eebfbda9.htm
---
# StructuralSectionRoundHSS Properties

Common set of parameters for structural analysis.